wpond/Orient-TDMA/efm32usb/inc/efm32_usbhal.h
static __INLINE void USBHAL_EnableGlobalInt( void )
{
  USB->GAHBCFG |= USB_GAHBCFG_GLBLINTRMSK;
}

static __INLINE void USBHAL_FlushRxFifo( void )
{
  USB->GRSTCTL = USB_GRSTCTL_RXFFLSH;
  while ( USB->GRSTCTL & USB_GRSTCTL_RXFFLSH ) {}
}

static __INLINE void USBHAL_FlushTxFifo( uint8_t fifoNum )
{
  USB->GRSTCTL = USB_GRSTCTL_TXFFLSH | ( fifoNum << _USB_GRSTCTL_TXFNUM_SHIFT );
  while ( USB->GRSTCTL & USB_GRSTCTL_TXFFLSH ) {}
}

static __INLINE uint32_t USBHAL_GetCoreInts( void )
{
  uint32_t retVal;

  retVal  = USB->GINTSTS;
  retVal &= USB->GINTMSK;

  return retVal;
}

static __INLINE void USBHAL_ReadFifo( uint8_t *dest, uint16_t byteCount )
{
#if 0
  int words, i;
#else
  int words, loops;
#endif

  uint32_t *data;
  __IO uint32_t *fifo;

  words = (byteCount + 3) / 4;
  data  = (uint32_t*)dest;
  fifo  = USB->FIFO0D;

#if 0
  for ( i=0; i<words; i++ )
  {
    *data++ = *fifo;
  }
#else
  /* Duff's Device ! */
  loops = ( words + 7 ) / 8;
  switch( words % 8)
  {
    case 0: do
            {
              *data++ = *fifo;
    case 7:   *data++ = *fifo;
    case 6:   *data++ = *fifo;
    case 5:   *data++ = *fifo;
    case 4:   *data++ = *fifo;
    case 3:   *data++ = *fifo;
    case 2:   *data++ = *fifo;
    case 1:   *data++ = *fifo;
            } while ( --loops );
  }
#endif
}

static __INLINE void USBHAL_FlushFifo( uint16_t byteCount )
{
  int words, loops;
  __IO uint32_t *fifo;

  words = (byteCount + 3) / 4;
  fifo  = USB->FIFO0D;

  /* Duff's Device ! */
  loops = ( words + 7 ) / 8;
  switch( words % 8)
  {
    case 0: do
            {
              *fifo;
    case 7:   *fifo;
    case 6:   *fifo;
    case 5:   *fifo;
    case 4:   *fifo;
    case 3:   *fifo;
    case 2:   *fifo;
    case 1:   *fifo;
            } while ( --loops );
  }
}

static __INLINE void USBHAL_WriteFifo( int epnum, uint8_t *src,
                                        uint16_t byteCount )
{
#if 0
  int words, i;
#else
  int words, loops;
#endif

  uint32_t *data;
  __IO uint32_t *fifo;

  words = (byteCount + 3) / 4;
  data  = (uint32_t*)src;
  fifo  = USB_FIFOS[ epnum ];

#if 0
  for ( i=0; i<words; i++ )
  {
    *fifo = *data++;
  }
#else
  /* Duff's Device ! */
  loops = ( words + 7 ) / 8;
  switch( words % 8)
  {
    case 0: do
            {
              *fifo = *data++;
    case 7:   *fifo = *data++;
    case 6:   *fifo = *data++;
    case 5:   *fifo = *data++;
    case 4:   *fifo = *data++;
    case 3:   *fifo = *data++;
    case 2:   *fifo = *data++;
    case 1:   *fifo = *data++;
            } while ( --loops );
  }
#endif
}

#if defined( USB_DEVICE )
static __INLINE void USBDHAL_ActivateEp( USBD_Ep_TypeDef *ep, bool forceIdle )
{
#define DIEP_MPS_EPTYPE_TXFNUM_MASK ( _USB_DIEP_CTL_MPS_MASK    | \
                                      _USB_DIEP_CTL_EPTYPE_MASK | \
                                      _USB_DIEP_CTL_TXFNUM_MASK )
#define DOEP_MPS_EPTYPE_MASK        ( _USB_DOEP_CTL_MPS_MASK    | \
                                      _USB_DOEP_CTL_EPTYPE_MASK )
  uint32_t daintmask, depctl;

  if ( forceIdle )
    ep->state = D_EP_IDLE;

  if ( ep->in )
  {
    daintmask = ep->mask;
    depctl = USB_DINEPS[ ep->num ].CTL & ~DEPCTL_WO_BITMASK;

    if ( !( depctl & USB_DIEP_CTL_USBACTEP ) )
    {
      depctl = ( depctl                                     &
                 ~( DIEP_MPS_EPTYPE_TXFNUM_MASK          |
                    USB_DIEP_CTL_STALL                     )  ) |
               ( ep->packetSize << _USB_DIEP_CTL_MPS_SHIFT    ) |
               ( ep->type       << _USB_DIEP_CTL_EPTYPE_SHIFT ) |
               ( ep->txFifoNum  << _USB_DIEP_CTL_TXFNUM_SHIFT ) |
               USB_DIEP_CTL_SETD0PIDEF                          |
               USB_DIEP_CTL_USBACTEP                            |
               USB_DIEP_CTL_SNAK;
    }
    else
    {
      depctl |= USB_DIEP_CTL_SETD0PIDEF;
    }
    USB_DINEPS[ ep->num ].CTL = depctl;
  }
  else
  {
    daintmask = ep->mask << _USB_DAINTMSK_OUTEPMSK0_SHIFT;
    depctl = USB_DOUTEPS[ ep->num ].CTL & ~DEPCTL_WO_BITMASK;

    if ( !( depctl & USB_DOEP_CTL_USBACTEP ) )
    {
      depctl = ( depctl                                     &
                 ~( DOEP_MPS_EPTYPE_MASK                 |
                    USB_DOEP_CTL_STALL                     )  ) |
               ( ep->packetSize << _USB_DOEP_CTL_MPS_SHIFT    ) |
               ( ep->type       << _USB_DOEP_CTL_EPTYPE_SHIFT ) |
               USB_DOEP_CTL_SETD0PIDEF                          |
               USB_DOEP_CTL_USBACTEP                            |
               USB_DOEP_CTL_SNAK;
    }
    else
    {
      depctl |= USB_DOEP_CTL_SETD0PIDEF;
    }
    USB_DOUTEPS[ ep->num ].CTL = depctl;
  }

  /* Enable interrupt for this EP */
  USB->DAINTMSK |= daintmask;

#undef DIEP_MPS_EPTYPE_TXFNUM_MASK
#undef DOEP_MPS_EPTYPE_MASK
}

static __INLINE void USBDHAL_ClearRemoteWakeup( void )
{
  USB->DCTL &= ~( DCTL_WO_BITMASK | USB_DCTL_RMTWKUPSIG );
}

static __INLINE void USBDHAL_DeactivateEp( USBD_Ep_TypeDef *ep )
{
  uint32_t daintmask;

  if ( ep->in )
  {
    USB_DINEPS[ ep->num ].CTL = 0;
    daintmask = ep->mask;
  }
  else
  {
    USB_DOUTEPS[ ep->num ].CTL = 0;
    daintmask = ep->mask << _USB_DAINTMSK_OUTEPMSK0_SHIFT;
  }

  /* Disable interrupt for this EP */
  USB->DAINTMSK &= ~daintmask;
}

static __INLINE void USBDHAL_EnableInts( USBD_Device_TypeDef *dev )
{
  uint32_t mask;

  /* Disable all interrupts. */
  USB->GINTMSK = 0;

  /* Clear pending interrupts */
  USB->GINTSTS = 0xFFFFFFFF;

  mask = USB_GINTMSK_USBSUSPMSK     |
#if defined( USB_SLAVEMODE )
         USB_GINTMSK_RXFLVLMSK      |
#endif
         USB_GINTMSK_USBRSTMSK      |
         USB_GINTMSK_ENUMDONEMSK    |
         USB_GINTMSK_IEPINTMSK      |
         USB_GINTMSK_OEPINTMSK      |
         USB_GINTMSK_WKUPINTMSK     |
         USB_GINTMSK_SESSREQINTMSK;

  if ( dev->callbacks->sofInt )
  {
    mask |= USB_GINTMSK_SOFMSK;
  }

  USB->GINTMSK = mask;
}

static __INLINE void USBDHAL_EnableUsbResetInt( void )
{
  /* Disable all interrupts. */
  USB->GINTMSK = 0;

  /* Clear pending interrupts */
  USB->GINTSTS = 0xFFFFFFFF;

